/* 
  Model.strings
  Secrets

  Created by Paulo Andrade on 23/01/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// Generic
"Generic.InvalidValue" = "Valor inválido para %@";
"Generic.CreationDate" = "Criado";
"Generic.ModificationDate" = "Modificado";
"Generic.Notes" = "Notas";
"Generic.Tags" = "Identificadores";
"Generic.Secret.Single" = "Segredo";
"Generic.Secret.Plural" = "Segredos";

/* Item title after a copy */
"Generic.CopiedItemName" = "Cópia de %@";

// Credentials
"Credential.Single" = "Login";
"Credential.Plural" = "Logins";
"Credential.New" = "Novo Login";
"Credential.Items" = "%d login(s)";

"Credential.Properties.identifier" = "Utilizador";
"Credential.Properties.secret" = "Palavra-passe";
"Credential.Properties.secrets" = "Histórico de palavras-passe";
"Credential.Properties.services" = "Serviços";
"Credential.Properties.tags" = "Identificadores";

// Softwared licenses
"SoftwareLicense.Single" = "Licença de Software";
"SoftwareLicense.Plural" = "Licenças de Software";
"SoftwareLicense.Software" = "Software";
"SoftwareLicense.License.Single" = "Licença";
"SoftwareLicense.New" = "Nova licença";
"SoftwareLicense.Items" = "%d licença(s)";

"SoftwareLicense.Properties.key" = "Chave";
"SoftwareLicense.Properties.orderNumber" = "Número de encomenda";
"SoftwareLicense.Properties.orderTotal" = "Total da encomenda";
"SoftwareLicense.Properties.owner" = "Titular";
"SoftwareLicense.Properties.publisher" = "Editor";
"SoftwareLicense.Properties.purchaseDate" = "Data de compra";
"SoftwareLicense.Properties.supportEmail" = "E-mail de suporte";
"SoftwareLicense.Properties.version" = "Versão do software";
"SoftwareLicense.Properties.website" = "Site";

// Wallet
"Wallet.Single" = "Carteira";
"WalletItem.Single" = "Item da carteira";
"WalletItem.Plural" = "Itens da carteira";
"Wallet.Items" = "%d item(ns) da carteira";

// Bank Account
"BankAccount.Single" = "Conta Bancária";
"BankAccount.Plural" = "Contas Bancárias";
"BankAccount.New" = "Nova conta bancária";

"BankAccount.Properties.accountHolder" = "Titular da conta";
"BankAccount.Properties.bankName" = "Banco";
"BankAccount.Properties.iban" = "IBAN";
"BankAccount.Properties.number" = "Número da conta";
"BankAccount.Properties.routingNumber" = "Número de encaminhamento";
"BankAccount.Properties.swiftCode" = "SWIFT";

// Credit card
"CreditCard.Single" = "Cartão de crédito";
"CreditCard.Plural" = "Cartões de crédito";
"CreditCard.New" = "Novo cartão de crédito";

"CreditCard.Brand.visa" = "Visa";
"CreditCard.Brand.mastercard" = "MasterCard";
"CreditCard.Brand.amex" = "American Express";
"CreditCard.Brand.diners" = "Diners Club";
"CreditCard.Brand.discover" = "Discover";
"CreditCard.Brand.jcb" = "JCB";
"CreditCard.Brand.solo" = "Solo";
"CreditCard.Brand.maestro" = "Maestro";
"CreditCard.Brand.visaelectron" = "Visa Electron";
"CreditCard.Brand.other" = "Outro";

"CreditCard.Properties.pan" = "Número do cartão";
"CreditCard.Properties.cardholder" = "Titular do cartão";
"CreditCard.Properties.expirationDate" = "Data de validade";
"CreditCard.Properties.brand" = "Emissor";
"CreditCard.Properties.pin" = "PIN";
"CreditCard.Properties.securityCode" = "Código de segurança";

"CreditCard.Errors.InvalidPAN" = "Número do cartão de crédito tem ser composto por dígitos apenas";

// Notes
"Note.Single" = "Nota";
"Note.Plural" = "Notas";
"Note.New" = "Nova nota";
"Note.Items" = "%d nota(s)";

// Service
"Service.URL" = "URL";

"Service.Properties.address" = "endereço";

"Service.Errors.InvalidAddress" = "O endereço de um serviço deve ser um URL válido";

// One-Time Passwords
"OneTimePassword.Single" = "Senha descartável";
"OneTimePassword.Plural" = "Senhas descartáveis";
"OneTimePassword.Seed.Long" = "Segredo da senha descartável";
"OneTimePassword.Seed.Short" = "Segredo";

